In [1]:
import pandas as pd

In [23]:
sk = pd.read_csv('../../../data/news/skNewsCrawl2.csv')
samsung = pd.read_csv('../../../data/news/newsCrawl1.csv')
naver = pd.read_csv('../../../data/news/naverNewsCrawl2.csv')
kakao = pd.read_csv('../../../data/news/kakaoNewsCrawl2.csv')

In [26]:
sk.head(3)

,company,date,text,title
0,SK하이닉스,2023. 6. 5. 10:10,SK하이닉스가 외국인 투자자를 대상으로 지난 4월 발행한 17억 달러(한화 2조23...,"‘11만닉스’ 된 SK하이닉스, 교환사채 2000만주 증시에 언제 풀릴까"
1,SK하이닉스,2023. 6. 7. 17:44,[이천=뉴시스] 김종택 기자 =경기도 이천 SK하이닉스 본사 모습. 2023.04....,"SK하이닉스 노조, '기본급 6.5% 인상·성과급 확대' 요구"
2,SK하이닉스,2023. 6. 1. 17:39,SK하이닉스가 인텔에서 인수한 낸드플래시 사업 부문(현 솔리다임)과 시너지 효과를 ...,반도체 불황의 충격파 SK하이닉스 '낸드 부진'

In [25]:
samsung.head(3)

,company,date,text,title
0,삼성전자,2023. 6. 7. 11:20,삼성전자의 엑시노스 오토 V920. 삼성전자 제공\n\n삼성전자가 현대자동차와 차량...,"삼성전자·현대차, 모빌리티 힘 모은다…車 인포테인먼트 첫 협력"
1,삼성전자,2023. 6. 1. 21:06,[서울=뉴시스]이영희 삼성전자 DX부문 글로벌마케팅실장 사장. (사진 = 삼성전자)...,"이영희 삼성전자 사장 ""갤럭시 언팩 국내서 하는 까닭은…"""
2,삼성전자,2023. 6. 7. 15:52,지난해 8월 서울 서초구 삼성전자 딜라이트에 '갤럭시Z플립4'와 '갤럭시Z폴드4'가...,"“폴더블폰 원조” 삼성전자, ‘갤럭시 언팩’ 최초로 국내서 7월 말 연다"

In [27]:
naver.head(3)

,company,date,text,title
0,네이버,2023. 6. 1. 20:45,박경식 씨\n\n“성의학 자료를 외설물이라고 파기하다니….”\n\n\n\n“유해한 ...,"‘김현철 국정개입 폭로’ 의사, 네이버 고소…“내 자료 파기”"
1,네이버,2023. 6. 4. 13:24,[서울=뉴시스] 네이버 오피스가 지난 1일 자사 홈페이지에 서비스를 11월30일에 ...,"네이버 오피스 11월 서비스 종료…""네이버 폼도 이젠 안녕"""
2,네이버,2023. 6. 2. 10:04,네이버는 지난 3월부터 27명의 임직원으로 구성된 ‘프로젝트 꽃’ 앰배서더를 구축하...,"네이버 임직원, 지역 소상공인 만나 디지털 전환 경험 공유"

In [28]:
kakao.head(3)

,company,date,text,title
0,카카오주식,2023. 6. 6. 04:08,뉴욕증시가 하반기 한풀 꺾일 것이란 전문가들의 전망이 나왔습니다.\n\n글로벌 투자...,"모건스탠리, S&P 지수 3,900으로 하락 예상…“한국 주식은 낙관”"
1,카카오주식,2023. 6. 3. 06:02,\n\n신용융자 이자율이 증권사에 따라 최대 두 배 이상 차이 나는 것으로 나타났다...,배 이상 차이 나는 주식 ‘빚투’ 이자율… 하나‧미래‧유진證 상위
2,카카오주식,2023. 6. 2. 13:34,"올해 1분기 국민연금 국내주식, 채권 거래풀에서 하나증권과 유안타증권이 동시 탈락의...","국민연금, 1분기 국내주식·채권 거래풀서 하나·유안타 동반 탈락"

In [29]:
samsung.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17368 entries, 0 to 17367
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   company  17368 non-null  object
 1   date     16495 non-null  object
 2   text     17363 non-null  object
 3   title    17359 non-null  object
dtypes: object(4)
memory usage: 542.9+ KB

In [30]:
naver.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17371 entries, 0 to 17370
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   company  17371 non-null  object
 1   date     16872 non-null  object
 2   text     17197 non-null  object
 3   title    17197 non-null  object
dtypes: object(4)
memory usage: 543.0+ KB

In [31]:
sk.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13250 entries, 0 to 13249
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   company  13250 non-null  object
 1   date     12352 non-null  object
 2   text     13250 non-null  object
 3   title    13247 non-null  object
dtypes: object(4)
memory usage: 414.2+ KB

In [32]:
kakao.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6002 entries, 0 to 6001
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   company  6002 non-null   object
 1   date     5823 non-null   object
 2   text     5999 non-null   object
 3   title    5999 non-null   object
dtypes: object(4)
memory usage: 187.7+ KB

In [34]:
kakaoUrl = pd.read_csv('../../../data/news/newsUrlCrawl3.csv')  
kakaoUrl.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13825 entries, 0 to 13824
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  13825 non-null  int64
 1   company     13825 non-null  object
 2   title       13825 non-null  object
 3   url         13825 non-null  object
dtypes: int64(1), object(3)
memory usage: 432.2+ KB